# SQL Practice: Business Questions and Raw SQL Queries

This notebook is designed to help you practice SQL for real business scenarios. You will connect to your database, create example tables, insert data, and answer business questions using raw SQL queries.

In [17]:
# Set Up Database Connection
# Best Practice: Use SQLAlchemy for safe, flexible DB connections
# Best Practice: Never hardcode credentials in production; use environment variables or config files
from sqlalchemy import create_engine, text
import pandas as pd

# Update the connection string as needed for your environment
engine = create_engine('mysql+mysqldb://root:root7623@localhost:3306/logistics_db')

# Test connection
with engine.connect() as conn:
    result = conn.execute(text('SELECT 1'))
    print('Database connection successful:', result.scalar() == 1)

Database connection successful: True

## Create Example Tables and Insert Data

The following cells create example tables and insert sample data for practice.

In [18]:
# Create tables and insert sample data
# Best Practice: Always reset tables and disable foreign key checks for repeatable practice
# Best Practice: Use IF NOT EXISTS for idempotent table creation
# Best Practice: Use TRUNCATE to reset AUTO_INCREMENT and avoid FK errors
with engine.begin() as conn:
    conn.execute(text('''
    SET FOREIGN_KEY_CHECKS = 0;
    TRUNCATE TABLE order_items;
    TRUNCATE TABLE orders;
    TRUNCATE TABLE products;
    TRUNCATE TABLE customers;
    SET FOREIGN_KEY_CHECKS = 1;
    '''))
    conn.execute(text('''
    CREATE TABLE IF NOT EXISTS customers (
        id INT PRIMARY KEY AUTO_INCREMENT,
        name VARCHAR(100),
        email VARCHAR(100)
    );
    CREATE TABLE IF NOT EXISTS products (
        id INT PRIMARY KEY AUTO_INCREMENT,
        name VARCHAR(100),
        price DECIMAL(10,2)
    );
    CREATE TABLE IF NOT EXISTS orders (
        id INT PRIMARY KEY AUTO_INCREMENT,
        customer_id INT,
        order_date DATE,
        FOREIGN KEY (customer_id) REFERENCES customers(id)
    );
    CREATE TABLE IF NOT EXISTS order_items (
        id INT PRIMARY KEY AUTO_INCREMENT,
        order_id INT,
        product_id INT,
        quantity INT,
        FOREIGN KEY (order_id) REFERENCES orders(id),
        FOREIGN KEY (product_id) REFERENCES products(id)
    );
    '''))
    # Best Practice: Insert data in parent tables first, then child tables
    conn.execute(text('''
    INSERT INTO customers (name, email) VALUES
        ('Alice', 'alice@example.com'),
        ('Bob', 'bob@example.com'),
        ('Carol', 'carol@example.com');
    INSERT INTO products (name, price) VALUES
        ('Widget', 10.00),
        ('Gadget', 20.00),
        ('Thingamajig', 15.00);
    INSERT INTO orders (customer_id, order_date) VALUES
        (1, '2025-09-01'),
        (2, '2025-09-02'),
        (1, '2025-09-03');
    INSERT INTO order_items (order_id, product_id, quantity) VALUES
        (1, 1, 2),
        (1, 2, 1),
        (2, 2, 3),
        (3, 3, 5);
    '''))
print('Sample tables and data created.')

Sample tables and data created.

## Business Question 1: Total Sales by Product

What is the total sales amount for each product?

In [19]:
# Raw SQL: Total sales by product
# Best Practice: Use explicit JOINs, GROUP BY, and ORDER BY for clarity
# Best Practice: Avoid SELECT *; specify columns needed
query = '''
SELECT p.name AS product, SUM(oi.quantity * p.price) AS total_sales
FROM order_items oi
JOIN products p ON oi.product_id = p.id
GROUP BY p.id, p.name
ORDER BY total_sales DESC;
'''
df = pd.read_sql(query, engine)
df

       product  total_sales
0       Gadget         80.0
1  Thingamajig         75.0
2       Widget         20.0

## Business Question 2: Top 5 Customers by Revenue

Who are the top 5 customers who have generated the most revenue?

In [20]:
# Raw SQL: Top 5 customers by revenue
# Best Practice: Use LIMIT for pagination/top-N queries
# Best Practice: Use aggregation and GROUP BY for business metrics
query = '''
SELECT c.name AS customer, SUM(oi.quantity * p.price) AS revenue
FROM customers c
JOIN orders o ON c.id = o.customer_id
JOIN order_items oi ON o.id = oi.order_id
JOIN products p ON oi.product_id = p.id
GROUP BY c.id, c.name
ORDER BY revenue DESC
LIMIT 5;
'''
df = pd.read_sql(query, engine)
df

  customer  revenue
0    Alice    115.0
1      Bob     60.0

# Best Practice: Test queries with edge cases and large datasets
- Try queries with empty tables, NULL values, and very large numbers of rows.
- Use LIMIT and OFFSET to paginate results for large datasets.
- Validate query performance and correctness with realistic data volumes.
- Use automated tests (see `tests/` folder) to ensure business logic is robust.

In [21]:
# Best Practice: Analyze and optimize queries with EXPLAIN and indexes
query = 'EXPLAIN SELECT * FROM orders WHERE customer_id = 1;'
df = pd.read_sql(query, engine)
df
# If needed, create an index:
# with engine.connect() as conn:
#     conn.execute(text('CREATE INDEX idx_orders_customer_id ON orders(customer_id);'))

,id,select_type,table,partitions,type,possible_keys,key,key_len,ref,rows,filtered,Extra
0,1,SIMPLE,orders,None,ref,customer_id,customer_id,5,const,2,100.0,None

In [29]:
# Best Practice: Use transactions for multi-step changes
from sqlalchemy import text
with engine.begin() as conn:  # BEGIN and COMMIT automatically
    # Example: Insert a new order and order item atomically
    conn.execute(text('''
        INSERT INTO orders (customer_id, order_date)
        VALUES (1, NOW())
    '''))
    conn.execute(text('''
        INSERT INTO order_items (order_id, product_id, quantity)
        VALUES (LAST_INSERT_ID(), 2, 5)
    '''))
# If an error occurs, changes are rolled back automatically

In [30]:
# Best Practice: Avoid SELECT * in production queries; specify needed columns
# Not recommended:
query_star = 'SELECT * FROM customers;'
df_star = pd.read_sql(query_star, engine)
# Recommended:
query_cols = 'SELECT id, name, email FROM customers;'
df_cols = pd.read_sql(query_cols, engine)
df_cols.head()

   id   name              email
0   1  Alice  alice@example.com
1   2    Bob    bob@example.com
2   3  Carol  carol@example.com

In [31]:
# Best Practice: Use CTEs (WITH) for complex queries to improve readability
query = '''
WITH customer_revenue AS (
    SELECT c.id, c.name, SUM(oi.quantity * p.price) AS revenue
    FROM customers c
    JOIN orders o ON c.id = o.customer_id
    JOIN order_items oi ON o.id = oi.order_id
    JOIN products p ON oi.product_id = p.id
    GROUP BY c.id, c.name
)
SELECT name, revenue
FROM customer_revenue
WHERE revenue > 10000
ORDER BY revenue DESC;
'''
df = pd.read_sql(query, engine)
df

Empty DataFrame
Columns: [name, revenue]
Index: []

In [32]:
# Best Practice: Prefer explicit JOINs over implicit joins in WHERE clauses
# Explicit JOIN (recommended):
query_explicit = '''
SELECT c.name, o.id
FROM customers c
JOIN orders o ON c.id = o.customer_id
'''
df_explicit = pd.read_sql(query_explicit, engine)
# Implicit join (not recommended):
query_implicit = '''
SELECT c.name, o.id
FROM customers c, orders o
WHERE c.id = o.customer_id
'''
df_implicit = pd.read_sql(query_implicit, engine)
df_explicit.head(), df_implicit.head()

(    name  id
 0  Alice   1
 1  Alice   3
 2  Alice   4
 3  Alice   5
 4    Bob   2,
     name  id
 0  Alice   1
 1  Alice   3
 2  Alice   4
 3  Alice   5
 4    Bob   2)

In [33]:
# Best Practice: Write readable SQL with indentation, aliases, and comments
query = '''
SELECT
    c.name AS customer,
    COUNT(o.id) AS total_orders,  -- Count of orders per customer
    SUM(oi.quantity * p.price) AS total_spent  -- Total revenue
FROM customers c
JOIN orders o ON c.id = o.customer_id
JOIN order_items oi ON o.id = oi.order_id
JOIN products p ON oi.product_id = p.id
GROUP BY c.id, c.name
ORDER BY total_spent DESC
LIMIT 10
'''
df = pd.read_sql(query, engine)
df

  customer  total_orders  total_spent
0    Alice             5        315.0
1      Bob             1         60.0

In [34]:
# Best Practice: Use parameterized queries to prevent SQL injection
# Example: Find all orders for a given customer name (user input)
customer_name = 'Acme Corp'  # This should come from user input in real apps
query = '''
SELECT o.id, o.order_date
FROM orders o
JOIN customers c ON o.customer_id = c.id
WHERE c.name = %s
'''
df = pd.read_sql(query, engine, params=(customer_name,))
df

Empty DataFrame
Columns: [id, order_date]
Index: []

## Business Question 3: Monthly Sales Trend

What is the total sales amount for each month?

In [35]:
# Raw SQL: Monthly sales trend
query = """
SELECT DATE_FORMAT(o.order_date, '%%Y-%%m') AS month, SUM(oi.quantity * p.price) AS total_sales
FROM orders o
JOIN order_items oi ON o.id = oi.order_id
JOIN products p ON oi.product_id = p.id
GROUP BY month
ORDER BY month;
"""
df = pd.read_sql(query, engine)
df

     month  total_sales
0  2025-09        375.0

## Business Question 4: Products Never Sold

Which products have never been sold?

In [36]:
# Raw SQL: Products never sold
query = '''
SELECT p.name AS product
FROM products p
LEFT JOIN order_items oi ON p.id = oi.product_id
WHERE oi.id IS NULL;
'''
df = pd.read_sql(query, engine)
df

Empty DataFrame
Columns: [product]
Index: []

## Business Question 5: Average Order Value

What is the average value of all orders?

In [37]:
# Raw SQL: Average order value
query = '''
SELECT AVG(order_total) AS avg_order_value
FROM (
    SELECT o.id, SUM(oi.quantity * p.price) AS order_total
    FROM orders o
    JOIN order_items oi ON o.id = oi.order_id
    JOIN products p ON oi.product_id = p.id
    GROUP BY o.id
) sub;
'''
df = pd.read_sql(query, engine)
df

   avg_order_value
0             75.0